RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_rdc_regs.h
/*
 * CNT_POS (RO)
 *
 * sample number during the positive of rectify signal
 * 1: 1
 * 2: 2
 * …
 */
#define RDC_ACC_CNT_Q_CNT_POS_MASK (0xFFFFU)
#define RDC_ACC_CNT_Q_CNT_POS_SHIFT (0U)
#define RDC_ACC_CNT_Q_CNT_POS_GET(x) (((uint32_t)(x) & RDC_ACC_CNT_Q_CNT_POS_MASK) >> RDC_ACC_CNT_Q_CNT_POS_SHIFT)

/* Bitfield definition for register: SIGN_CNT_Q */
/*
 * CNT_NEG (RO)
 *
 * Positive sample counter during negative rectify signal
 */
#define RDC_SIGN_CNT_Q_CNT_NEG_MASK (0xFFFF0000UL)
#define RDC_SIGN_CNT_Q_CNT_NEG_SHIFT (16U)
#define RDC_SIGN_CNT_Q_CNT_NEG_GET(x) (((uint32_t)(x) & RDC_SIGN_CNT_Q_CNT_NEG_MASK) >> RDC_SIGN_CNT_Q_CNT_NEG_SHIFT)

/*
 * CNT_POS (RO)
 *
 * Negative sample counter during positive rectify signal
 */
#define RDC_SIGN_CNT_Q_CNT_POS_MASK (0xFFFFU)
#define RDC_SIGN_CNT_Q_CNT_POS_SHIFT (0U)
#define RDC_SIGN_CNT_Q_CNT_POS_GET(x) (((uint32_t)(x) & RDC_SIGN_CNT_Q_CNT_POS_MASK) >> RDC_SIGN_CNT_Q_CNT_POS_SHIFT)

/* Bitfield definition for register: AMP_MAX */
/*
 * MAX (RW)
 *
 * the maximum of acc amplitude
 */
#define RDC_AMP_MAX_MAX_MASK (0xFFFFFFFFUL)
#define RDC_AMP_MAX_MAX_SHIFT (0U)
#define RDC_AMP_MAX_MAX_SET(x) (((uint32_t)(x) << RDC_AMP_MAX_MAX_SHIFT) & RDC_AMP_MAX_MAX_MASK)
#define RDC_AMP_MAX_MAX_GET(x) (((uint32_t)(x) & RDC_AMP_MAX_MAX_MASK) >> RDC_AMP_MAX_MAX_SHIFT)

/* Bitfield definition for register: AMP_MIN */
/*
 * MIN (RW)
 *
 * the minimum of acc amplitude
 */
#define RDC_AMP_MIN_MIN_MASK (0xFFFFFFFFUL)
#define RDC_AMP_MIN_MIN_SHIFT (0U)
#define RDC_AMP_MIN_MIN_SET(x) (((uint32_t)(x) << RDC_AMP_MIN_MIN_SHIFT) & RDC_AMP_MIN_MIN_MASK)
#define RDC_AMP_MIN_MIN_GET(x) (((uint32_t)(x) & RDC_AMP_MIN_MIN_MASK) >> RDC_AMP_MIN_MIN_SHIFT)

/* Bitfield definition for register: INT_EN */
/*
 * INT_EN (RW)
 *
 * enable interrupt output
 */
#define RDC_INT_EN_INT_EN_MASK (0x80000000UL)
#define RDC_INT_EN_INT_EN_SHIFT (31U)
#define RDC_INT_EN_INT_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_INT_EN_SHIFT) & RDC_INT_EN_INT_EN_MASK)
#define RDC_INT_EN_INT_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_INT_EN_MASK) >> RDC_INT_EN_INT_EN_SHIFT)

/*
 * ACC_VLD_I_EN (RW)
 *
 * i_channel accumulate valid interrupt enable for i_channel
 */
#define RDC_INT_EN_ACC_VLD_I_EN_MASK (0x8000U)
#define RDC_INT_EN_ACC_VLD_I_EN_SHIFT (15U)
#define RDC_INT_EN_ACC_VLD_I_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_ACC_VLD_I_EN_SHIFT) & RDC_INT_EN_ACC_VLD_I_EN_MASK)
#define RDC_INT_EN_ACC_VLD_I_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_ACC_VLD_I_EN_MASK) >> RDC_INT_EN_ACC_VLD_I_EN_SHIFT)

/*
 * ACC_VLD_Q_EN (RW)
 *
 * q_channel accumulate valid interrupt enable for i_channel
 */
#define RDC_INT_EN_ACC_VLD_Q_EN_MASK (0x4000U)
#define RDC_INT_EN_ACC_VLD_Q_EN_SHIFT (14U)
#define RDC_INT_EN_ACC_VLD_Q_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_ACC_VLD_Q_EN_SHIFT) & RDC_INT_EN_ACC_VLD_Q_EN_MASK)
#define RDC_INT_EN_ACC_VLD_Q_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_ACC_VLD_Q_EN_MASK) >> RDC_INT_EN_ACC_VLD_Q_EN_SHIFT)

/*
 * RISING_DELAY_I_EN (RW)
 *
 * i_channel delayed rectify signal rising edge interrupt enable
 */
#define RDC_INT_EN_RISING_DELAY_I_EN_MASK (0x2000U)
#define RDC_INT_EN_RISING_DELAY_I_EN_SHIFT (13U)
#define RDC_INT_EN_RISING_DELAY_I_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_RISING_DELAY_I_EN_SHIFT) & RDC_INT_EN_RISING_DELAY_I_EN_MASK)
#define RDC_INT_EN_RISING_DELAY_I_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_RISING_DELAY_I_EN_MASK) >> RDC_INT_EN_RISING_DELAY_I_EN_SHIFT)

/*
 * FALLING_DELAY_I_EN (RW)
 *
 * i_channel delayed rectify signal falling edge interrupt enable
 */
#define RDC_INT_EN_FALLING_DELAY_I_EN_MASK (0x1000U)
#define RDC_INT_EN_FALLING_DELAY_I_EN_SHIFT (12U)
#define RDC_INT_EN_FALLING_DELAY_I_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_FALLING_DELAY_I_EN_SHIFT) & RDC_INT_EN_FALLING_DELAY_I_EN_MASK)
#define RDC_INT_EN_FALLING_DELAY_I_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_FALLING_DELAY_I_EN_MASK) >> RDC_INT_EN_FALLING_DELAY_I_EN_SHIFT)

/*
 * RISING_DELAY_Q_EN (RW)
 *
 * q_channel delayed rectify signal rising edge interrupt enable
 */
#define RDC_INT_EN_RISING_DELAY_Q_EN_MASK (0x800U)
#define RDC_INT_EN_RISING_DELAY_Q_EN_SHIFT (11U)
#define RDC_INT_EN_RISING_DELAY_Q_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_RISING_DELAY_Q_EN_SHIFT) & RDC_INT_EN_RISING_DELAY_Q_EN_MASK)
#define RDC_INT_EN_RISING_DELAY_Q_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_RISING_DELAY_Q_EN_MASK) >> RDC_INT_EN_RISING_DELAY_Q_EN_SHIFT)

/*
 * FALLING_DELAY_Q_EN (RW)
 *
 * q_channel delayed rectify signal falling edge interrupt enable
 */
#define RDC_INT_EN_FALLING_DELAY_Q_EN_MASK (0x400U)
#define RDC_INT_EN_FALLING_DELAY_Q_EN_SHIFT (10U)
#define RDC_INT_EN_FALLING_DELAY_Q_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_FALLING_DELAY_Q_EN_SHIFT) & RDC_INT_EN_FALLING_DELAY_Q_EN_MASK)
#define RDC_INT_EN_FALLING_DELAY_Q_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_FALLING_DELAY_Q_EN_MASK) >> RDC_INT_EN_FALLING_DELAY_Q_EN_SHIFT)

/*
 * SAMPLE_RISING_I_EN (RW)
 *
 * i_channel rising edge interrupt enable
 */
#define RDC_INT_EN_SAMPLE_RISING_I_EN_MASK (0x200U)
#define RDC_INT_EN_SAMPLE_RISING_I_EN_SHIFT (9U)
#define RDC_INT_EN_SAMPLE_RISING_I_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_SAMPLE_RISING_I_EN_SHIFT) & RDC_INT_EN_SAMPLE_RISING_I_EN_MASK)
#define RDC_INT_EN_SAMPLE_RISING_I_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_SAMPLE_RISING_I_EN_MASK) >> RDC_INT_EN_SAMPLE_RISING_I_EN_SHIFT)

/*
 * SAMPLE_FALLING_I_EN (RW)
 *
 * i_channel falling edge interrupt enable
 */
#define RDC_INT_EN_SAMPLE_FALLING_I_EN_MASK (0x100U)
#define RDC_INT_EN_SAMPLE_FALLING_I_EN_SHIFT (8U)
#define RDC_INT_EN_SAMPLE_FALLING_I_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_SAMPLE_FALLING_I_EN_SHIFT) & RDC_INT_EN_SAMPLE_FALLING_I_EN_MASK)
#define RDC_INT_EN_SAMPLE_FALLING_I_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_SAMPLE_FALLING_I_EN_MASK) >> RDC_INT_EN_SAMPLE_FALLING_I_EN_SHIFT)

/*
 * SAMPLE_RISING_Q_EN (RW)
 *
 * q_channel rising edge interrupt enable
 */
#define RDC_INT_EN_SAMPLE_RISING_Q_EN_MASK (0x80U)
#define RDC_INT_EN_SAMPLE_RISING_Q_EN_SHIFT (7U)
#define RDC_INT_EN_SAMPLE_RISING_Q_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_SAMPLE_RISING_Q_EN_SHIFT) & RDC_INT_EN_SAMPLE_RISING_Q_EN_MASK)
#define RDC_INT_EN_SAMPLE_RISING_Q_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_SAMPLE_RISING_Q_EN_MASK) >> RDC_INT_EN_SAMPLE_RISING_Q_EN_SHIFT)

