RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_rdc_regs.h
/*
 * SAMPLE_FALLING_Q_EN (RW)
 *
 * q_channel falling edge interrupt enable
 */
#define RDC_INT_EN_SAMPLE_FALLING_Q_EN_MASK (0x40U)
#define RDC_INT_EN_SAMPLE_FALLING_Q_EN_SHIFT (6U)
#define RDC_INT_EN_SAMPLE_FALLING_Q_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_SAMPLE_FALLING_Q_EN_SHIFT) & RDC_INT_EN_SAMPLE_FALLING_Q_EN_MASK)
#define RDC_INT_EN_SAMPLE_FALLING_Q_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_SAMPLE_FALLING_Q_EN_MASK) >> RDC_INT_EN_SAMPLE_FALLING_Q_EN_SHIFT)

/*
 * ACC_VLD_I_OVH_EN (RW)
 *
 * i_channel accumulate overflow interrupt enable
 */
#define RDC_INT_EN_ACC_VLD_I_OVH_EN_MASK (0x20U)
#define RDC_INT_EN_ACC_VLD_I_OVH_EN_SHIFT (5U)
#define RDC_INT_EN_ACC_VLD_I_OVH_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_ACC_VLD_I_OVH_EN_SHIFT) & RDC_INT_EN_ACC_VLD_I_OVH_EN_MASK)
#define RDC_INT_EN_ACC_VLD_I_OVH_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_ACC_VLD_I_OVH_EN_MASK) >> RDC_INT_EN_ACC_VLD_I_OVH_EN_SHIFT)

/*
 * ACC_VLD_Q_OVH_EN (RW)
 *
 * q_channel accumulate overflow interrupt enable
 */
#define RDC_INT_EN_ACC_VLD_Q_OVH_EN_MASK (0x10U)
#define RDC_INT_EN_ACC_VLD_Q_OVH_EN_SHIFT (4U)
#define RDC_INT_EN_ACC_VLD_Q_OVH_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_ACC_VLD_Q_OVH_EN_SHIFT) & RDC_INT_EN_ACC_VLD_Q_OVH_EN_MASK)
#define RDC_INT_EN_ACC_VLD_Q_OVH_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_ACC_VLD_Q_OVH_EN_MASK) >> RDC_INT_EN_ACC_VLD_Q_OVH_EN_SHIFT)

/*
 * ACC_VLD_I_OVL_EN (RW)
 *
 * i_channel accumulate underflow interrupt enable
 */
#define RDC_INT_EN_ACC_VLD_I_OVL_EN_MASK (0x8U)
#define RDC_INT_EN_ACC_VLD_I_OVL_EN_SHIFT (3U)
#define RDC_INT_EN_ACC_VLD_I_OVL_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_ACC_VLD_I_OVL_EN_SHIFT) & RDC_INT_EN_ACC_VLD_I_OVL_EN_MASK)
#define RDC_INT_EN_ACC_VLD_I_OVL_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_ACC_VLD_I_OVL_EN_MASK) >> RDC_INT_EN_ACC_VLD_I_OVL_EN_SHIFT)

/*
 * ACC_VLD_Q_OVL_EN (RW)
 *
 * q_channel accumulate underflow interrupt enable
 */
#define RDC_INT_EN_ACC_VLD_Q_OVL_EN_MASK (0x4U)
#define RDC_INT_EN_ACC_VLD_Q_OVL_EN_SHIFT (2U)
#define RDC_INT_EN_ACC_VLD_Q_OVL_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_ACC_VLD_Q_OVL_EN_SHIFT) & RDC_INT_EN_ACC_VLD_Q_OVL_EN_MASK)
#define RDC_INT_EN_ACC_VLD_Q_OVL_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_ACC_VLD_Q_OVL_EN_MASK) >> RDC_INT_EN_ACC_VLD_Q_OVL_EN_SHIFT)

/*
 * ACC_AMP_OVH_EN (RW)
 *
 * accumulate ample overflow interrupt enable
 */
#define RDC_INT_EN_ACC_AMP_OVH_EN_MASK (0x2U)
#define RDC_INT_EN_ACC_AMP_OVH_EN_SHIFT (1U)
#define RDC_INT_EN_ACC_AMP_OVH_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_ACC_AMP_OVH_EN_SHIFT) & RDC_INT_EN_ACC_AMP_OVH_EN_MASK)
#define RDC_INT_EN_ACC_AMP_OVH_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_ACC_AMP_OVH_EN_MASK) >> RDC_INT_EN_ACC_AMP_OVH_EN_SHIFT)

/*
 * ACC_AMP_OVL_EN (RW)
 *
 * accumulate ample underflow interrupt enable
 */
#define RDC_INT_EN_ACC_AMP_OVL_EN_MASK (0x1U)
#define RDC_INT_EN_ACC_AMP_OVL_EN_SHIFT (0U)
#define RDC_INT_EN_ACC_AMP_OVL_EN_SET(x) (((uint32_t)(x) << RDC_INT_EN_ACC_AMP_OVL_EN_SHIFT) & RDC_INT_EN_ACC_AMP_OVL_EN_MASK)
#define RDC_INT_EN_ACC_AMP_OVL_EN_GET(x) (((uint32_t)(x) & RDC_INT_EN_ACC_AMP_OVL_EN_MASK) >> RDC_INT_EN_ACC_AMP_OVL_EN_SHIFT)

/* Bitfield definition for register: ADC_INT_STATE */
/*
 * ACC_VLD_I_STA (W1C)
 *
 * i_channel accumulate valid interrupt status for i_channel
 */
#define RDC_ADC_INT_STATE_ACC_VLD_I_STA_MASK (0x8000U)
#define RDC_ADC_INT_STATE_ACC_VLD_I_STA_SHIFT (15U)
#define RDC_ADC_INT_STATE_ACC_VLD_I_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_I_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_I_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_I_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_I_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_I_STA_SHIFT)

/*
 * ACC_VLD_Q_STA (W1C)
 *
 * q_channel accumulate valid interrupt status for i_channel
 */
#define RDC_ADC_INT_STATE_ACC_VLD_Q_STA_MASK (0x4000U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_STA_SHIFT (14U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_Q_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_Q_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_Q_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_Q_STA_SHIFT)

/*
 * RISING_DELAY_I_STA (W1C)
 *
 * i_channel delayed rectify signal rising edge interrupt status
 */
#define RDC_ADC_INT_STATE_RISING_DELAY_I_STA_MASK (0x2000U)
#define RDC_ADC_INT_STATE_RISING_DELAY_I_STA_SHIFT (13U)
#define RDC_ADC_INT_STATE_RISING_DELAY_I_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_RISING_DELAY_I_STA_SHIFT) & RDC_ADC_INT_STATE_RISING_DELAY_I_STA_MASK)
#define RDC_ADC_INT_STATE_RISING_DELAY_I_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_RISING_DELAY_I_STA_MASK) >> RDC_ADC_INT_STATE_RISING_DELAY_I_STA_SHIFT)

/*
 * FALLING_DELAY_I_STA (W1C)
 *
 * i_channel delayed rectify signal falling edge interrupt status
 */
#define RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_MASK (0x1000U)
#define RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_SHIFT (12U)
#define RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_SHIFT) & RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_MASK)
#define RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_MASK) >> RDC_ADC_INT_STATE_FALLING_DELAY_I_STA_SHIFT)

/*
 * RISING_DELAY_Q_STA (W1C)
 *
 * q_channel delayed rectify signal rising edge interrupt status
 */
#define RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_MASK (0x800U)
#define RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_SHIFT (11U)
#define RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_SHIFT) & RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_MASK)
#define RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_MASK) >> RDC_ADC_INT_STATE_RISING_DELAY_Q_STA_SHIFT)

/*
 * FALLING_DELAY_Q_STA (W1C)
 *
 * q_channel delayed rectify signal falling edge interrupt status
 */
#define RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_MASK (0x400U)
#define RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_SHIFT (10U)
#define RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_SHIFT) & RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_MASK)
#define RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_MASK) >> RDC_ADC_INT_STATE_FALLING_DELAY_Q_STA_SHIFT)

