RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_rdc_regs.h
/*
 * SAMPLE_RISING_I_STA (W1C)
 *
 * i_channel rising edge interrupt status
 */
#define RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_MASK (0x200U)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_SHIFT (9U)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_SHIFT) & RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_MASK)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_MASK) >> RDC_ADC_INT_STATE_SAMPLE_RISING_I_STA_SHIFT)

/*
 * SAMPLE_FALLING_I_STA (W1C)
 *
 * i_channel falling edge interrupt status
 */
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_MASK (0x100U)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_SHIFT (8U)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_SHIFT) & RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_MASK)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_MASK) >> RDC_ADC_INT_STATE_SAMPLE_FALLING_I_STA_SHIFT)

/*
 * SAMPLE_RISING_Q_STA (W1C)
 *
 * q_channel rising edge interrupt status
 */
#define RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_MASK (0x80U)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_SHIFT (7U)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_SHIFT) & RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_MASK)
#define RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_MASK) >> RDC_ADC_INT_STATE_SAMPLE_RISING_Q_STA_SHIFT)

/*
 * SAMPLE_FALLING_Q_STA (W1C)
 *
 * q_channel falling edge interrupt status
 */
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_MASK (0x40U)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_SHIFT (6U)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_SHIFT) & RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_MASK)
#define RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_MASK) >> RDC_ADC_INT_STATE_SAMPLE_FALLING_Q_STA_SHIFT)

/*
 * ACC_VLD_I_OVH_STA (W1C)
 *
 * i_channel accumulate overflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_MASK (0x20U)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_SHIFT (5U)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_I_OVH_STA_SHIFT)

/*
 * ACC_VLD_Q_OVH_STA (W1C)
 *
 * q_channel accumulate overflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_MASK (0x10U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_SHIFT (4U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_Q_OVH_STA_SHIFT)

/*
 * ACC_VLD_I_OVL_STA (W1C)
 *
 * i_channel accumulate underflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_MASK (0x8U)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_SHIFT (3U)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_I_OVL_STA_SHIFT)

/*
 * ACC_VLD_Q_OVL_STA (W1C)
 *
 * q_channel accumulate underflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_MASK (0x4U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_SHIFT (2U)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_MASK) >> RDC_ADC_INT_STATE_ACC_VLD_Q_OVL_STA_SHIFT)

/*
 * ACC_AMP_OVH_STA (W1C)
 *
 * accumulate ample overflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_MASK (0x2U)
#define RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_SHIFT (1U)
#define RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_MASK) >> RDC_ADC_INT_STATE_ACC_AMP_OVH_STA_SHIFT)

/*
 * ACC_AMP_OVL_STA (W1C)
 *
 * accumulate ample underflow interrupt status
 */
#define RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_MASK (0x1U)
#define RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_SHIFT (0U)
#define RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_SET(x) (((uint32_t)(x) << RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_SHIFT) & RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_MASK)
#define RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_GET(x) (((uint32_t)(x) & RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_MASK) >> RDC_ADC_INT_STATE_ACC_AMP_OVL_STA_SHIFT)




#endif /* HPM_RDC_H */
